src/Documents/ВводОстатковПередачВПроизводство/ВводОстатковПередачВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковПередачВПроизводство</name>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПроизводственноеЗадание</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВводОстатковПередачВПроизводство/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр Передач в производство Приход
Движения.ПередачиВПроизводство.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ПередачиВПроизводство.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Документ = ТекСтрокаТабличнаяЧасть.Документ;
	Движение.ВидМПЗ = ТекСтрокаТабличнаяЧасть.ВидМПЗ;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;
КонецПроцедуры
